### 열 재구성
열 순서 변경

In [9]:
# 라이브러리 불러오기
import seaborn as sns

# titanic 데이터셋의 부분을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')

df = titanic.loc[0:4, 'survived':'age']
df

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [10]:
# 열 이름의 리스트 만들기
columns = list(df.columns.values)
columns

['survived', 'pclass', 'sex', 'age']

In [18]:
# 열 이름을 알파벳 순으로 정렬하기
columns_sorted = sorted(columns)    # 알파벳 순으로 정렬
print(columns_sorted)
df_sorted = df[columns_sorted]
df_sorted

['age', 'pclass', 'sex', 'survived']

    age  pclass     sex  survived
0  22.0       3    male         0
1  38.0       1  female         1
2  26.0       3  female         1
3  35.0       1  female         1
4  35.0       3    male         0

In [21]:
# 열 이름을 기존 순서의 정반대 역순으로 정렬하기
print(columns_sorted)
columns_reversed = list(reversed(columns_sorted))  
print(columns_reversed)
df_reversed = df[columns_reversed]
df_reversed

['age', 'pclass', 'sex', 'survived']
['survived', 'sex', 'pclass', 'age']

   survived     sex  pclass   age
0         0    male       3  22.0
1         1  female       1  38.0
2         1  female       3  26.0
3         1  female       1  35.0
4         0    male       3  35.0

In [16]:
# 열 이름을 사용자가 정의한 임의의 순서로 재배치하기
columns_customed = ['pclass', 'sex', 'age', 'survived']  
df_customed = df[columns_customed]
df_customed

   pclass     sex   age  survived
0       3    male  22.0         0
1       1  female  38.0         1
2       3  female  26.0         1
3       1  female  35.0         1
4       3    male  35.0         0